config.org
#+title: MacPapo's Config
#+author: Jacopo Costantini


* General Settings

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;; init.el --- Load the full configuration -*- lexical-binding: t -*-

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

  (setq custom-file (locate-user-emacs-file "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))

  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
  (setq inhibit-startup-screen t)

  (setq-default
   window-resize-pixelwise t
   frame-resize-pixelwise t)

  (let ((no-border '(internal-border-width . 0)))
    (add-to-list 'default-frame-alist no-border)
    (add-to-list 'initial-frame-alist no-border))

  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))))

  ;; TODO: sposta da qui
  (setq-default history-length 1000)
  (add-hook 'after-init-hook 'savehist-mode)

#+end_src

** GC Optimizations

#+begin_src elisp :tangle ~/.emacs.d/early-init.el
  ;; -*- lexical-binding: t; -*
  (defconst *is-a-mac* (eq system-type 'darwin))
  (setq package-enable-at-startup nil)

      ;;; Runtime optimizations
  ;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
  (setq auto-mode-case-fold nil)

  ;; PERF: Disable bidirectional text scanning for a modest performance boost.
  ;;   I've set this to `nil' in the past, but the `bidi-display-reordering's docs
  ;;   say that is an undefined state and suggest this to be just as good:
  (setq-default bidi-display-reordering 'left-to-right
        	bidi-paragraph-direction 'left-to-right)

  ;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
  ;;   reordering of bidirectional text with embedded parentheses (and other
  ;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
  (setq bidi-inhibit-bpa t)  ; Emacs 27+ only

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; More performant rapid scrolling over unfontified regions. May cause brief
  ;; spells of inaccurate syntax highlighting right after scrolling, which should
  ;; quickly self-correct.
  ;; (setq fast-but-imprecise-scrolling t)

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
  (setq idle-update-delay 1.0)  ; default is 0.5

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
  ;; hasn't been determined, but do it anyway, just in case. This increases memory
  ;; usage, however!
  (setq inhibit-compacting-font-caches t)

  ;; Increase how much is read from processes in a single chunk (default is 4kb).
  ;; This is further increased elsewhere, where needed (like our LSP module).
  (setq read-process-output-max (* 64 1024))  ; 64kb

  ;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
  ;; receiving input, which should help a little with scrolling performance.
  (setq redisplay-skip-fontification-on-input t)

      ;;; Disable UI elements early
  ;; PERF,UI: Doom strives to be keyboard-centric, so I consider these UI elements
  ;;   clutter. Initializing them also costs a morsel of startup time. Whats more,
  ;;   the menu bar exposes functionality that Doom doesn't endorse. Perhaps one
  ;;   day Doom will support these, but today is not that day.
  ;;
  ;; HACK: I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;;   `scroll-bar-mode' because they do extra work to manipulate frame variables
  ;;   that isn't necessary this early in the startup process.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  ;; And set these to nil so users don't have to toggle the modes twice to
  ;; reactivate them.
  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)
  ;; FIX: On MacOS, disabling the menu bar makes MacOS treat Emacs as a
  ;;   non-application window -- which means it doesn't automatically capture
  ;;   focus when it is started, among other things, so enable the menu-bar for
  ;;   GUI frames, but keep it disabled in terminal frames because there it
  ;;   activates an ugly, in-frame menu bar.
  (when *is-a-mac*
    (add-hook 'window-setup-hook 'doom-restore-menu-bar-in-gui-frames-h)
    (add-hook 'after-make-frame-functions 'doom-restore-menu-bar-in-gui-frames-h)
    (defun doom-restore-menu-bar-in-gui-frames-h (&optional frame)
      (let ((use-frame (or frame (selected-frame))))
        (when (display-graphic-p use-frame)
          (set-frame-parameter use-frame 'menu-bar-lines 1)))))

  ;;; Encodings
  ;; Contrary to what many Emacs users have in their configs, you don't need more
  ;; than this to make UTF-8 the default coding system:
  (set-language-environment "UTF-8")

  (setq default-input-method nil)

  (let ((normal-gc-cons-threshold (* 20 1024 1024))
        (init-gc-cons-threshold (* 128 1024 1024)))
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold normal-gc-cons-threshold))))
#+end_src

** Package manager configuration

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-pkgmanager.el
  ;; -*- lexical-binding: t; -*-
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (eval-when-compile
    (require 'use-package)
    (require 'straight)
    (setq straight-use-package-by-default t))

  (use-package diminish)

  (provide 'init-pkgmanager)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-pkgmanager)
#+end_src

** User local preferences

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-local nil t) 
#+end_src

** Appearance

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-theme.el
  ;; -*- lexical-binding: t; -*-

  (use-package zenburn-theme
    :init
    (setq custom-safe-themes t)
    (load-theme 'zenburn t))

  (use-package pulsar
    :config
    (setq pulsar-pulse t
          pulsar-face 'pulsar-yellow
          pulsar-highlight-face 'pulsar-yellow
          pulsar-delay 0.055)
    (add-to-list 'pulsar-pulse-functions 'ace-window)
    (pulsar-global-mode 1))

  (provide 'init-theme)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-theme)
#+end_src


** Keybindings

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-macos.el
  ;; -*- lexical-binding: t; -*-

  (when *is-a-mac*
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'none)

    (use-package exec-path-from-shell
      :config
      (exec-path-from-shell-initialize))

    (use-package osx-trash
      :config
      (setq delete-by-moving-to-trash t)
      (osx-trash-setup))

    (use-package reveal-in-osx-finder
      :bind ("C-c z" . reveal-in-osx-finder))

    ;; (global-set-key (kbd "M-`") 'ns-next-frame)
    ;; (global-set-key (kbd "M-h") 'ns-do-hide-emacs)
    ;; (global-set-key (kbd "M-˙") 'ns-do-hide-others)
    ;; (global-set-key (kbd "M-ˍ") 'ns-do-hide-others) ;; what describe-key reports for cmd-option-h
    )

  (provide 'init-macos)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-macos)
#+end_src

** Editing Utils

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-editing-utils.el
  ;; -*- lexical-binding: t; -*-

  (use-package electric-pair
    :straight nil
    :hook after-init)

  (use-package electric-indent
    :straight nil
    :hook after-init)

  (setq-default
   blink-cursor-interval 0.4
   bookmark-default-file (locate-user-emacs-file ".bookmarks.el")
   buffers-menu-max-size 30
   case-fold-search t
   column-number-mode t
   ediff-split-window-function 'split-window-horizontally
   ediff-window-setup-function 'ediff-setup-windows-plain
   indent-tabs-mode nil
   create-lockfiles nil
   auto-save-default nil
   make-backup-files nil
   mouse-yank-at-point t
   save-interprogram-paste-before-kill t
   scroll-preserve-screen-position 'always
   set-mark-command-repeat-pop t
   tooltip-delay 1.5
   truncate-lines nil
   visible-bell t
   use-short-answers t
   kill-do-not-save-duplicates t
   echo-keystrokes 0.02
   truncate-partial-width-windows nil)

  (use-package delete-selection
    :straight nil
    :hook after-init)

  (use-package hippie-expand
    :straight nil
    :bind ("M-/" . hippie-expand)
    :config
    (setq hippie-expand-try-functions-list
          '(try-complete-file-name-partially
            try-complete-file-name
            try-expand-dabbrev
            try-expand-dabbrev-all-buffers
            try-expand-dabbrev-from-kill)))

  (use-package global-auto-revert
    :diminish auto-revert
    :straight nil
    :hook after-init
    :config
    (setq global-auto-revert-non-file-buffers t
          auto-revert-verbose nil))

  (use-package uniquify
    :straight nil
    :config
    (setq uniquify-buffer-name-style 'reverse
          uniquify-separator " • "
          uniquify-after-kill-buffer-p t
          uniquify-ignore-buffers-re "^\\*"))

  (use-package transient-mark
    :straight nil
    :hook after-init)

  (use-package subword
    :diminish subword
    :straight nil
    :hook after-init)

  (use-package display-line-numbers
    :straight nil
    :hook prog-mode
    :config
    (setq-default display-line-numbers-width 3))

  (use-package display-fill-column-indicator
    :straight nil
    :hook prog-mode
    :config
    (setq-default indicate-buffer-boundaries 'left
                  display-fill-column-indicator-character ?\u254e))

  (use-package show-paren
    :straight nil
    :hook after-init)

  (put 'narrow-to-region 'disabled nil)
  (put 'narrow-to-page 'disabled nil)
  (put 'narrow-to-defun 'disabled nil)

  (put 'upcase-region 'disabled nil)
  (put 'downcase-region 'disabled nil)

  (use-package avy
    :bind (("C-:"   . avy-goto-char)
           ("C-'"   . avy-goto-char-2)
           ("M-g f" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)
           ("M-g e" . avy-goto-word-0)
           ("M-Z"   . zap-up-to-char))
    :config
    (setq avy-background t)
    (setq avy-style 'at-full))

  (use-package origami
    :hook prog-mode
    :bind (("C-c f" . origami-recursively-toggle-node)
           ("C-c F" . origami-toggle-all-nodes)))

  (use-package multiple-cursors
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C->" . mc/mark-next-like-this)
           ("C-<" . mc/mark-previous-like-this)
           ("C-c C-<" . mc/mark-all-like-this)))

  (use-package ace-mc
    :bind (("C-c M-j" . ace-mc-add-multiple-cursors)
           ("C-c M-k" . ace-mc-add-single-cursor)))

  (global-unset-key [M-left])
  (global-unset-key [M-right])

  (use-package whole-line-or-region
    :demand t
    :diminish whole-line-or-region-local-mode)

  (global-set-key (kbd "M-j") 'join-line)

  (use-package anzu
    :bind (([remap query-replace-regexp] . anzu-query-replace-regexp)
           ([remap query-replace]        . anzu-query-replace)
           ("C-c a r"                    . anzu-query-replace-at-cursor)
           :map isearch-mode-map
           ([remap isearch-delete-char]  . isearch-del-char))
    :config
    (setq anzu-mode-lighter "")
    (global-anzu-mode +1))

  (use-package highlight-escape-sequences
    :init
    (add-hook 'after-init-hook 'hes-mode))

  (use-package recentf
    :straight nil
    :hook after-init
    :config
    (setq-default
     recentf-max-saved-items 1000
     recentf-exclude `("/tmp/" "/ssh:" ,(concat package-user-dir "/.*-autoloads\\.el\\'"))))

  (use-package info-colors
    :hook (Info-selection . info-colors-fontify-node))

  (use-package shfmt)

  (use-package dotenv-mode)

  (use-package crux
    :bind
    ([remap move-beginning-of-line] . crux-move-beginning-of-line)
    ([remap kill-whole-line]        . crux-kill-whole-line)
    ("C-<backspace>"                . crux-kill-line-backwards)
    ("C-S-o"                        . crux-smart-open-line-above)
    ("C-o"                          . crux-smart-open-line)
    ("C-c n"                        . crux-cleanup-buffer-or-region)
    ("C-c d"                        . crux-duplicate-current-line-or-region)
    ("C-c M-d"                      . crux-duplicate-and-comment-current-line-or-region)
    ("C-c r"                        . crux-rename-file-and-buffer)
    ("C-x C-u"                      . crux-upcase-region)
    ("C-x C-l"                      . crux-downcase-region)
    ("C-x M-c"                      . crux-capitalize-region)
    ("M-j"                          . crux-top-join-line))

  (use-package rainbow-delimiters
    :hook prog-mode)

  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode))

  (use-package embark
    :bind (("C-." . embark-act)
           ("C-;" . embark-dwim)
           ("C-h B" . embark-bindings)))

  (provide 'init-editing-utils)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-editing-utils)
#+end_src

