config.org
** Treesitter

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-treesitter.el
  ;; -*- lexical-binding: t; -*-

  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (common-lisp "https://github.com/theHamsta/tree-sitter-commonlisp")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (csharp "https://github.com/tree-sitter/tree-sitter-c-sharp")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (go-mod "https://github.com/camdencheek/tree-sitter-go-mod")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (js . ("https://github.com/tree-sitter/tree-sitter-javascript" "master" "src"))
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (lua "https://github.com/Azganoth/tree-sitter-lua")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (r "https://github.com/r-lib/tree-sitter-r")
          (rust "https://github.com/tree-sitter/tree-sitter-rust")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
          (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

  (setq treesit-load-name-override-list nil
        treesit-font-lock-level 4)

  (use-package treesit-auto
    :config
    (global-treesit-auto-mode))

  (provide 'init-treesitter)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-treesitter)
#+end_src

** Flymake Flycheck

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-flymake.el
  ;; -*- lexical-binding: t; -*-
  
  (use-package flymake-flycheck
    :bind (:map flymake-mode-map
                ("C-c ! l" . flymake-show-buffer-diagnostics)
                ("C-c ! n" . flymake-goto-next-error)
                ("C-c ! p" . flymake-goto-prev-error)
                ("C-c ! c" . flymake-start))
    :hook ((prog-mode     . flymake-mode)
           (text-mode     . flymake-mode)
           (flymake-mode  . (lambda ()
                              (setq-local flymake-diagnostic-functions
                                          (append flymake-diagnostic-functions
                                                  (flymake-flycheck-all-chained-diagnostic-functions)))))
           (flycheck-mode . (lambda ()
                              (setq-default flycheck-disabled-checkers
                                            (append (default-value 'flycheck-disabled-checkers)
                                                    '(emacs-lisp emacs-lisp-checkdoc emacs-lisp-package))))))
    :config
    (setq flymake-proc-allowed-file-name-masks nil))

  (provide 'init-flymake)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-flymake)
#+end_src

** Tramp

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-tramp.el

  (use-package tramp
    :straight nil
    :config
    (setq remote-file-name-inhibit-cache nil
          tramp-verbose 6
          tramp-inline-compress-start-size 1000000
          tramp-default-method "ssh"))

  (provide 'init-tramp)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-tramp)
#+end_src


** Shell

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-shell.el
  ;; -*- lexical-binding: t; -*-

  ;;(global-set-key (kbd "C-c e") 'eshell)

  (use-package eshell-prompt-extras
    :init
    (with-eval-after-load "esh-opt"
      (autoload 'epe-theme-lambda "eshell-prompt-extras")
      (setq eshell-highlight-prompt nil
            eshell-prompt-function 'epe-theme-lambda)))

  (use-package eshell-syntax-highlighting
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (provide 'init-shell)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-shell)
#+end_src

* Packages

** Dired

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dired.el
  ;; -*- lexical-binding: t; -*-

  (require 'dired)
  (setq-default dired-dwim-target t)

  ;; Prefer g-prefixed coreutils version of standard utilities when available
  (let ((gls (executable-find "gls")))
    (when gls (setq insert-directory-program gls)))

  (use-package diredfl
    :config
    (diredfl-global-mode 1))

  (use-package dired-recent
    :init
    (dired-recent-mode 1))

  (use-package dired-hacks-utils
    :bind (:map dired-mode-map
                ("M-n" . dired-hacks-next-file)
                ("M-p" . dired-hacks-previous-file)))

  (use-package dired-filter
    :bind (:map dired-mode-map
                ("/" . dired-filter-mode)))

  (use-package dired-subtree
    :bind (:map dired-mode-map
                ("i" . dired-subtree-insert)
                (";" . dired-subtree-remove)))

  (use-package dired-narrow
    :bind (:map dired-mode-map
                ("s" . dired-narrow))
    :config
    (setq dired-narrow-exit-when-1-left nil))

  (provide 'init-dired)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dired)
#+end_src

** Helm Completion

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-helm.el
  ;; -*- lexical-binding: t; -*-

  (use-package helm
    :diminish helm-mode
    :bind (("C-x b"   . helm-mini)
           ("M-x"     . helm-M-x)
           ("C-x C-f" . helm-find-files)
           ("M-y"     . helm-show-kill-ring)
           ("<f1> f"  . helm-apropos)
           ("C-c o"   . helm-imenu)
           ("C-c b"   . helm-bookmarks)
           ("C-c t"   . helm-themes)
           ("<f1> l"  . helm-locate-library)
           :map helm-find-files-map
           ("C-c C-i" . helm-ff-properties-persistent))
    :config
    (setq helm-M-x-fuzzy-match                  t
          helm-buffers-fuzzy-matching           t
          helm-recentf-fuzzy-match              t
          helm-locate-fuzzy-match               t
          helm-candidate-number-limit           200
          helm-split-window-inside-p            t
          helm-always-two-windows               nil
          helm-display-buffer-default-height    15
          helm-move-to-line-cycle-in-source     t
          helm-autoresize-max-height            40
          helm-autoresize-min-height            20
          helm-M-x-show-short-doc               t
          helm-default-display-buffer-functions '(display-buffer-in-side-window)
          helm-boring-buffer-regexp-list        '("\\*copilot-balancer\\*"
                                                  "\\*straight-process\\*"
                                                  "\\*code-conv\\*"))
    (helm-mode 1)
    (helm-autoresize-mode 1))

  (use-package helm-projectile
    :after (helm projectile)
    :config
    (helm-projectile-on)
    :bind (("C-c p h" . helm-projectile)
           ("C-c p p" . helm-projectile-switch-project)
           ("C-c p f" . helm-projectile-find-file)
           ("C-c p g" . helm-projectile-grep)))

  (use-package helm-git-grep
    :after helm
    :bind (("C-c g" . helm-git-grep)
           ("C-c G" . helm-git-grep-at-point))
    :config
    (setq helm-git-grep-include-submodules t)
    (setq helm-git-grep-use-iomenu-last-pattern t))

  (use-package helm-ls-git
    :bind (("M-g G" . helm-browse-project)
           ("M-g H" . helm-projects-history)))

  (use-package helm-gitignore
    :after helm)

  (use-package helm-themes
    :after helm)

  (use-package helm-swoop
    :after helm
    :bind (("M-i"     . helm-swoop)
           ("M-I"     . helm-swoop-back-to-last-point)
           ("C-c M-i" . helm-multi-swoop)
           ("C-x M-i" . helm-multi-swoop-all)
           :map isearch-mode-map
           ("M-i"     . helm-swoop-from-isearch)
           :map helm-swoop-map
           ("M-i"     . helm-multi-swoop-all-from-helm-swoop)
           ("M-m"     . helm-multi-swoop-current-mode-from-helm-swoop)
           ("C-r"     . helm-previous-line)
           ("C-s"     . helm-next-line)
           ("C-r"     . helm-previous-line)
           ("C-s"     . helm-next-line))
    :config
    (setq helm-multi-swoop-edit-save t
          helm-swoop-split-with-multiple-windows nil
          helm-swoop-split-direction 'split-window-vertically
          helm-swoop-speed-or-color nil
          helm-swoop-move-to-line-cycle t
          helm-swoop-use-line-number-face t
          helm-swoop-use-fuzzy-match t))

  (use-package helm-rg
    :after helm
    :bind ("C-c k" . helm-rg))

  (use-package helm-mt
    :after helm
    :bind (("C-x T" . helm-mt))
    :config
    (helm-mt/reroute-terminal-functions t))

  (use-package helm-tramp
    :after helm
    :bind (("C-c s" . helm-tramp))
    ;; :hook ((helm-tramp-pre-command . '(lambda ()
    ;;                                     (global-aggressive-indent-mode 0)
    ;;                                     (projectile-mode 0)
    ;;                                     (editorconfig-mode 0)))
    ;;        (helm-tramp-quit        . '(lambda ()
    ;;                                     (global-aggressive-indent-mode 1)
    ;;                                     (projectile-mode 1)
    ;; (editorconfig-mode 1))))
    )

  (use-package helm-make
    :after helm
    :bind ("C-c c" . helm-make-projectile))

  (use-package helm-descbinds
    :after helm
    :bind ("<f2> D" . helm-descbinds))

  (use-package helm-osx-app
    :bind (("C-c SPC" . helm-osx-app)))

  (use-package helm-c-yasnippet
    :after (yasnippet helm)
    :bind (("C-c Y" . helm-yas-complete)
           ("<f6>"  . helm-yas-visit-snippet-file))
    :config
    (setq helm-yas-space-match-any-greedy t))

  (provide 'init-helm)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
 ;; (require 'init-helm)
#+end_src

** Ivy Completion

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-ivy.el
  ;; -*- lexical-binding: t; -*-

  (use-package ivy
    :diminish ivy-mode
    :bind (("C-x b" . ivy-switch-buffer)
           ("C-c v" . ivy-push-view)
           ("C-c V" . ivy-pop-view))
    :config
    (setq ivy-use-virtual-buffers        t
          ivy-count-format               "(%d/%d) "
          ivy-display-style              'fancy
          ivy-initial-inputs-alist       nil
          enable-recursive-minibuffers   t
          ivy-wrap t)
    (ivy-mode 1))

  (use-package ivy-rich
    :config
    (ivy-rich-modify-column
     'ivy-switch-buffer
     'ivy-rich-switch-buffer-major-mode
     '(:width 20 :face error))
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("M-x"     . counsel-M-x)
           ("C-x C-f" . counsel-find-file)
           ("M-y"     . counsel-yank-pop)
           ("<f1> f"  . counsel-describe-function)
           ("<f1> v"  . counsel-describe-variable)
           ("<f1> l"  . counsel-find-library)
           ("<f2> i"  . counsel-info-lookup-symbol)
           ("<f2> u"  . counsel-unicode-char)
           ("<f2> j"  . counsel-set-variable)

           ;; Ivy-based interface to shell and system tools
           ("C-c c"   . counsel-compile)
           ("C-c g"   . counsel-git)
           ("C-c j"   . counsel-git-grep)
           ("C-c L"   . counsel-git-log)
           ("C-c k"   . counsel-rg)
           ("C-x l"   . counsel-locate)
           ("C-c J"   . counsel-file-jump)

           ;; Ivy-resume and other commands
           ("C-c C-r" . ivy-resume)
           ("C-c b"   . counsel-bookmark)
           ("C-c D"   . counsel-descbinds)
           ("C-c o"   . counsel-outline)
           ("C-c t"   . counsel-load-theme)
           ("C-c F"   . counsel-org-file)))

  (use-package marginalia
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
    :init
    (marginalia-mode))

  (provide 'init-ivy)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-ivy)
#+end_src

** Ido

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-ido.el
  ;; -*- lexical-binding: t; -*-

  (use-package ido
    :config
    (setq ido-enable-prefix nil
          ido-case-fold t
          ido-auto-merge-work-directories-length -1
          ido-create-new-buffer 'always
          ido-use-filename-at-point nil
          ido-use-virtual-buffers 'auto
          ido-virtual-buffers t
          ido-file-extensions-order '(".org" ".el" ".c" ".cpp" ".rb" ".java" ".lisp" ".md" ".dart")
          ido-use-faces t
          ido-max-prospects 10)
    (add-to-list 'ido-ignore-directories "target")
    (add-to-list 'ido-ignore-directories "node_modules")
    (ido-mode 1)
    (ido-everywhere 1))

  (use-package ido-completing-read+
    :config
    (ido-ubiquitous-mode 1))

  (use-package smex
    :bind (("M-x" . smex)
           ("M-X" . smex-major-mode-commands))
    :config
    (smex-initialize))

  (use-package icomplete
    :straight nil
    :config
    (icomplete-mode 1))

  (provide 'init-ido)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-ido)
#+end_src

