config.org
** Projectile

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-projectile.el
  ;; -*- lexical-binding: t; -*-

  (use-package projectile
    :defer 5
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :config
    (setq projectile-indexing-method                'alien
          projectile-sort-order                     'modification-time
          projectile-enable-caching                 t
          projectile-per-project-compilation-buffer t
          projectile-mode-line-function             '(lambda ()
                                                       (format " Proj[%s]"
                                                               (projectile-project-name))))
     (projectile-mode +1))

  (use-package projectile-git-autofetch
    :diminish projectile-git-autofetch-mode
    :config
    (projectile-git-autofetch-mode 1))

  (provide 'init-projectile)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-projectile)
#+end_src

** Grep

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-grep.el
  ;; -*- lexical-binding: t; -*-

  (setq-default grep-highlight-matches t
                grep-scroll-output t)

  (when *is-a-mac*
    (setq-default locate-command "mdfind"))

  (use-package wgrep
    :bind (:map grep-mode-map
           ("C-c C-q" . wgrep-change-to-wgrep-mode)))

  (use-package deadgrep
    :bind ("<f5>" . deadgrep))

  (provide 'init-grep)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-grep)
#+end_src

** Corfu

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-corfu.el
  ;; -*- lexical-binding: t; -*-

  (use-package corfu
    :hook
    ((shell-mode  . (lambda () (setq-local corfu-auto nil)))
     (eshell-mode . (lambda () (setq-local corfu-auto nil)))
     (term-mode   . (lambda () (setq-local corfu-auto nil)))
     (after-init  . global-corfu-mode))
    :custom
    (corfu-cycle t)
    (corfu-auto t) 
    (corfu-commit-predicate nil)
    (corfu-quit-no-match t)
    (corfu-auto-delay 0)
    (corfu-auto-prefix 1)
    :bind (:map corfu-map
                ("TAB" . corfu-insert)
                ([tab] . corfu-insert))

  (provide 'init-corfu)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-corfu)
#+end_src

** Company

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-company.el
  ;; -*- lexical-binding: t; -*-

  (use-package company
    :hook ((prog-mode . (lambda ()
                          (setq-local company-backends
                                      '((company-capf :with company-yasnippet)))
                          (company-mode)))
           (text-mode . (lambda ()
                          (setq-local company-backends
                                      '((company-dabbrev company-ispell :separate)
                                        company-files))
                          (company-mode))))
    :config
    (setq company-tooltip-align-annotations t
          company-selection-wrap-around t
          company-lighter-base "©"
          company-tooltip-limit 10
          company-idle-delay 0.0
          company-minimum-prefix-length 1
          company-require-match nil
          company-format-margin-function 'company-text-icons-margin
          company-tooltip-minimum 4
          company-text-face-extra-attributes '(:weight bold :slant italic)
          company-text-icons-add-background t
          company-tooltip-flip-when-above t
          company-show-quick-access 'left
          company-files-exclusions '(".git/" ".DS_Store")
          company-transformers '(delete-consecutive-dups
                             company-sort-by-occurrence)
          company-global-modes '(not erc-mode message-mode eshell-mode))
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection)))

  (provide 'init-company)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-company)
#+end_src


** Eglot

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-eglot.el
  ;; -*- lexical-binding: t; -*-

  (require 'eglot)

  (setq read-process-output-max (* 3 1024 1024))
  
  ;; Default of 800 was too low.
  ;; Avoid Lisp nesting exceeding in swift-mode.
  (setq max-lisp-eval-depth 10000)

  (provide 'init-eglot)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-eglot)
#+end_src

** LSP Mode

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-lsp.el
  ;; -*- lexical-binding: t; -*-

  (use-package lsp-mode
    :commands lsp
    :hook ((c-ts-mode . lsp))
    :config
    (require 'lsp-clients)
    (setq lsp-log-io nil)
    (setq lsp-idle-delay 0.500)
    (setq lsp-auto-guess-root t))

  (provide 'init-lsp)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-lsp)
#+end_src

** Windows

Ace Window Config
Remember:
x - delete window
m - swap windows
M - move window
c - copy window
j - select buffer
n - select the previous window
u - select buffer in the other window
c - split window fairly, either vertically or horizontally
v - split window vertically
b - split window horizontally
o - maximize current window
? - show these command bindings

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-windows.el
  ;; -*- lexical-binding: t; -*-

  (use-package winner-mode
    :straight nil
    :hook after-init)

  (use-package ace-window
    :bind ("M-o" . ace-window)
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

  (provide 'init-windows)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-windows)
#+end_src

** Git

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-git.el
  ;; -*- lexical-binding: t; -*-

  (use-package git-modes)

  (use-package git-timemachine
    :bind ("C-x v t" . git-timemachine-toggle))

  (use-package magit
    :bind
    (([(meta f12)] . magit-status)
     ("C-x g"      . magit-status)
     ("C-x M-g"    . magit-dispatch))
    :hook (magit-mode . (lambda () (local-unset-key [(meta h)])))
    :config
    (setq-default magit-diff-refine-hunk 'all))

  (use-package forge
    :after magit)

  (use-package diff-hl
    :hook ((dired-mode         . diff-hl-dired-mode)
           (magit-post-refresh . diff-hl-magit-post-refresh)
           (after-init         . global-diff-hl-mode))
    :bind (:map diff-hl-mode-map
                ("<left-fringe> <mouse-1>" . diff-hl-diff-goto-hunk)))

  (provide 'init-git)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-git)
#+end_src

** ORG MODE

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-org.el
  ;; -*- lexical-binding: t; -*-

  (use-package org)

  (use-package org-wc
    :after org)

  (use-package org-pomodoro
    :after org)

  (use-package org-zettelkasten
    :hook org-mode)

  (use-package org-super-agenda
    :after org-agenda
    :config
    (setq org-agenda-files '("~/org/agenda/agenda.org"
                             "~/org/agenda/sessione.org"))
    (setq org-super-agenda-groups
          '((:name "Oggi"
                   :time-grid t
                   :scheduled today)
            (:name "Importante"
                   :priority "A")))
    (org-super-agenda-mode))

  (provide 'init-org)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-org)
#+end_src

** Yasnippet

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-yasnippet.el
  (use-package yasnippet
    :defer 5
    :diminish yasnippet
    :bind (:map  yas-minor-mode-map
                 ("<backtab>" . yas-expand))
    :config
    ;;(setq yas-snippet-dirs '("~/.emacs.d/personal-snippets"))
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)

  (provide 'init-yasnippet)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-yasnippet)
#+end_src

* Languages

** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dart.el
  ;; -*- lexical-binding: t; -*-

  (use-package dart-mode
    :bind (:map dart-mode-map
                ("C-M-x" . flutter-run-or-hot-reload)))

  (use-package flutter
    :config
    (setq flutter-sdk-path "~/FlutterDev/flutter/"))

  (provide 'init-dart)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dart)
#+end_src

** C/C++

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-cxx.el
  
  (defvar +cc-default-compiler-options
    `((c-mode . nil)
      (c++-mode
       . ,(list "-std=c++17" ; use C++17 draft by default
                (when *is-a-mac*
                  ;; NOTE beware: you'll get abi-inconsistencies when passing
                  ;; std-objects to libraries linked with libstdc++ (e.g. if you
                  ;; use boost which wasn't compiled with libc++)
                  "-stdlib=libc++")))
      (objc-mode . nil))
    "A list of default compiler options for the C family. These are ignored if a
  compilation database is present in the project.")

  (use-package modern-cpp-font-lock
    :hook (c++-mode . modern-c++-font-lock-mode))

  (use-package disaster)

  (use-package cmake-mode)

  (use-package flycheck-clang-analyzer
    :hook (c++-ts-mode . (lambda () (setq flycheck-clang-language-standard "c++17")))
    :config (flycheck-clang-analyzer-setup))

  (provide 'init-cxx)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-cxx)
#+end_src
